using System;
using System.Globalization;
using System.Numerics;

namespace BasicConsolelO
{
    class Program
    {
        static void Main(string[] args)
        {
            FormatNumericalData();
            Console.ReadLine();
        }

        private static void FormatNumericalData()
        {
            CultureInfo.CurrentCulture = new CultureInfo("en-US");
            Console.WriteLine("{0,69}", "Форматирование строк");
            Console.WriteLine("---Форматы чисел-------------------------------------------------------------------------------------------------------");
            Console.WriteLine("|{0,57}| |{1,-57:d}|", "(d) формат целых чисел", 1234);
            Console.WriteLine("|{0,57}| |{1,-57:d5}|", "(d5) дополняет до 5 '0'", 1234);
            Console.WriteLine("|{0,57}| |{1,-57:E}|", "(Е) экспоненциальный формат", 123.456);
            Console.WriteLine("|{0,57}| |{1,-57:e2}|", "(е2) строчный регистр, с точностью 2", 123.456);
            Console.WriteLine("|{0,57}| |{1,-57:f}|", "(f) формат дробных чисел", 1234.5678);
            Console.WriteLine("|{0,57}| |{1,-57:f3}|", "(f3) в дробной части 3 знака", 1234.5678);
            Console.WriteLine("|{0,57}| |{1,-57:n}|", "(n) формат дробных чисел с разделителем", 1234.5678);
            Console.WriteLine("|{0,57}| |{1,-57:n4}|", "(n4) в дробной части 4 знака", 1234.5678);
            Console.WriteLine("|{0,57}| |{1,-57:g}|", "(g) выбирает более короткий из форматов: (f) или (e)", 0.000123);
            Console.WriteLine("|{0,57}| |{1,-57:g}|", "(g) выбирает формат (e)", 0.0000123);
            Console.WriteLine("|{0,57}| |{1,-57:g2}|", "(g2) с точностью 2", 0.0000123);
            Console.WriteLine("|{0,57}| |{1,-57:r}|", "(r) формат обратного преобразования", new BigInteger(Int64.MaxValue));
            Console.WriteLine("|{0,57}| |{1,-57}|", "гарантирует обратное преобразование", "");
            Console.WriteLine("|{0,57}| |{1,-57}|", "из string в BigInteger без потери", "");
            Console.WriteLine("---Специальные форматы чисел-------------------------------------------------------------------------------------------");
            Console.WriteLine("|{0,57}| |{1,-57:c}|", "(c) формат валюты", 1234);
            Console.WriteLine("|{0,57}| |{1,-57:c0}|", "(c0) с точностью 2", 1234);
            Console.WriteLine("|{0,57}| |{1,-57:p}|", "(p) формат процентов", 0.12);
            Console.WriteLine("|{0,57}| |{1,-57:p0}|", "(p0) с точностью 0", 0.12);
            Console.WriteLine("|{0,57}| |{1,-57:X}|", "(X) шестнадцатеричный формат", 1234);
            Console.WriteLine("|{0,57}| |{1,-57:x2}|", "(x) строчный регистр, дополняет до 5 '0'", 1234);
            Console.WriteLine("---Настраиваемые форматы чисел-----------------------------------------------------------------------------------------");
            Console.WriteLine("|{0,57}| |{1,-57:0000.0000}|", "(0) заместитель цифры или нуля", 123.456);
            Console.WriteLine("|{0,57}| |{1,-57:00.00}|", "(0) заместитель цифры или нуля", 123.456);
            Console.WriteLine("|{0,57}| |{1,-57:####.####}|", "(#) заместитель цифры", 123.456);
            Console.WriteLine("|{0,57}| |{1,-57:##.##}|", "(#) заместитель цифры", 123.456);
            Console.WriteLine("|{0,57}| |{1,-57:##.##}|", "(.) разделитель целой и дробной части", 12.34);
            Console.WriteLine("|{0,57}| |{1,-57:#,###}|", "(,) разделитель групп", 1234);
            Console.WriteLine("|{0,57}| |{1,-57:##%}|", "(%) процент", 0.12);
            Console.WriteLine("|{0,57}| |{1,-57:###‰}|", "(‰) промилле", 0.123);
            Console.WriteLine("|{0,57}| |{1,-57:<##.##>;[##.##];ноль}|", "(;) разделитель секций", 12.34);
            Console.WriteLine("|{0,57}| |{1,-57:<##.##>;[##.##];ноль}|", "определяет секции с раздельными строками формата", -12.34);
            Console.WriteLine("|{0,57}| |{1,-57:<##.##>;[##.##];ноль}|", "для положительных чисел, отрицательных чисел и нуля", 0);
            Console.WriteLine("-----------------------------------------------------------------------------------------------------------------------");
        }
    }
}
